package com.yjh.platform.common.result;

/**
 * @author tt
 * @ClassName: ResultCodeEnum
 * @Description: 自定义错误异常码
 * @date 2018/5/16 16:29
 */
public enum ResultCodeEnum {

    SYSTEMERROR(500, "系统异常"),
    DELETESUCCESS(204, "用户删除数据成功"),
    NORMAL(200, "正常"),
    UNAUTHORIZED(401, "用户没有登录，或没有accessToken"),
    CREATEORUPDATEERROR(201, "新建或修改数据失败"),
    DELETEERROR(206, "删除数据失败"),
    QUERYERROR(208, "数据查询失败"),
    UPDATEERROR(209, "更新数据失败"),
    RUNTASKFAILURE(213, "运行任务失败"),
    INVALIDREQUEST(400, "用户发出的请求有错误，服务器没有进行新建或修改数据的操作"),
    ACCEPTED(202, "表示一个请求已经进入后台排队（异步任务）"),
    FORBIDDEN(403, "用户得到授权（与401错误相对），但是访问是被禁止的"),
    NOTFOUND(404, "请求针对的是不存在的记录，服务器没有进行操作"),
    NOTACCEPTABLE(406, "请求的格式不可得"),
    PARAMERROR(407, "请求参数错误"),
    GONE(410, "用户请求的资源被永久删除，且不会再得到的"),
    UNPROCESABLEENTITY(422, "创建一个对象时，发生一个验证错误"),
    FILEUPLOADERROR(600, "文件上传异常"),
    UNSUPPORTFILETYPE(601, "不支持的文件格式"),
    FILEDELETED(602, "您要下载的资源已被删除！！"),
    CODE0(0, "成功"),
    CODE1(1, "未知错误"),


    CODE10001(10001, "服务暂时不可用"),
    CODE10002(10002, "请求来自未经授权的IP地址"),
    CODE10003(10003, "无权限访问该用户数据"),
    CODE10004(10004, "来自该refer的请求无访问权限"),
    CODE10005(10005, "请求参数无效"),
    CODE10006(10006, "请求参数过多"),
    CODE10007(10007, "无效的ip参数"),
    CODE10008(10008, "获取未授权的字段"),
    CODE10009(10009, "无效的操作方法"),
    CODE10010(10010, "指定的对象不存在"),
    CODE10011(10011, "指定的对象已存在"),
    CODE10012(10012, "数据库操作出错，请重试"),
    CODE10013(10013, "日期格式错误"),
    CODE10014(10014, "图片格式错误"),
    CODE10015(10015, "附件格式错误"),
    CODE10016(10016, "数据库返回数据有误"),
    CODE10017(10017, "测点不存在"),
    CODE10018(10018, "日期范围无效"),
    CODE10019(10019, "日期范围不能大于7天"),
    CODE10101(10101, "用户名或者密码错误"),
    CODE10102(10102, "无效的user id"),
    CODE10103(10103, "无效的access token"),
    CODE10104(10104, "无效的appkey"),
    CODE10105(10105, "无效的appsecret"),
    CODE10106(10106, "session过期"),
    CODE10107(10107, "缺少access_token参数"),
    CODE10108(10108, "缺少appkey参数"),
    CODE10109(10109, "缺少appsecret参数"),
    CODE10201(10201, "空间名称不合法"),
    CODE10202(10202, "设备名称不合法"),
    CODE10203(10203, "测点名称不合法"),
    CODE10204(10204, "空间不存在"),
    CODE10205(10205, "设备不存在"),
    CODE10206(10206, "空间和设备绑定失败"),
    CODE10207(10207, "无效的手机号码"),
    CODE10208(10208, "无效的电话号码"),
    CODE10209(10209, "无效的邮政编码"),
    CODE10210(10210, "空间不可用"),
    CODE20001(20001, "未识别到用户认证信息，请重新登录或稍后重试"),
    CODE20002(20002, "会话过期，请稍后重试"),
    CODE20003(20003, "认证信息无法识别"),
    CODE20004(20004, "没有权限操作该API分组"),
    CODE20005(20005, "没有权限操作该API"),
    CODE20006(20006, "请求参数错误"),
    CODE20007(20007, "请求参数为空"),
    CODE20008(20008, "参数值小于最小值"),
    CODE20009(20009, "参数值大于最大值"),
    CODE20010(20010, "参数值不在可选范围内"),
    CODE20011(20011, "参数长度太短"),
    CODE20012(20012, "参数长度太长"),
    CODE20013(20013, "参数长度非法"),
    CODE20014(20014, "参数只能是字母"),
    CODE20015(20015, "参数只能是数字"),
    CODE20016(20016, "参数只能是字母或数字"),
    CODE20017(20017, "参数规则不匹配"),
    CODE20018(20018, "参数匹配到不期望匹配的规则"),
    CODE20019(20019, "参数只能是字母、数字、下划线或中划线"),
    CODE20020(20020, "无效的邮件地址"),
    CODE20021(20021, "无效的IP地址"),
    CODE20022(20022, "不是base64编码的字符"),
    CODE20023(20023, "无效的端口号"),
    CODE20024(20024, "请求的路径参数未在请求路径中定义"),
    CODE20025(20025, "后端的路径参数未在后端路径中定义"),
    CODE20026(20026, "后端参数映射的请求参数未定义"),
    CODE20027(20027, "指定的API分组不存在"),
    CODE20028(20028, "指定的API不存在"),
    CODE20029(20029, "指定的API分组未通过审核"),
    CODE20030(20030, "请求过于频繁，请稍后重试"),
    CODE20031(20031, "网关超时"),
    CODE20032(20032, "服务不可用"),
    CODE20033(20033, "不正确的网关"),
    CODE20034(20034, "请求的功能暂未实现"),
    CODE20035(20035, "不允许请求该方法"),
    CODE20036(20036, "请求的地址不存在"),
    CODE20037(20037, "请求被禁止"),
    CODE20038(20038, "请求未授权"),
    CODE20039(20039, "系统错误，请联系管理员"),
    CODE20040(20040, "接口调用次数已达到设定的上限"),
    CODE20041(20041, "需要GET请求"),
    CODE20042(20042, "需要POST请求"),
    CODE20043(20043, "需要HTTPS请求"),
    CODE20044(20044, "API功能未授权"),
    CODE20045(20045, "POST数据参数不合法"),
    CODE20046(20046, "API注册失败"),
    CODE20047(20047, "API发布失败"),
    CODE20048(20048, "本机IP在黑名单"),
    CODE20049(20049, "本机IP未授权"),
    CODE30001(30001, "模型附件格式不正确"),
    CODE30002(30002, "模型名称非法"),
    CODE30003(30003, "模型注册失败"),
    CODE30004(30004, "模型发布失败"),
    CODE30005(30005, "表达式格式不正确"),
    CODE30006(30006, "创建对象失败"),
    CODE30007(30007, "修改对象失败"),
    CODE30008(30008, "删除对象失败"),
    CODE30009(30009, "表达式时间不正确");

    private int code;
    private String name;

    private ResultCodeEnum(int code, String name) {
        this.code = code;
        this.name = name;
    }

    public int getCode() {
        return this.code;
    }

    public String getName() {
        return this.name;
    }

    public static ResultCodeEnum getNameByCode(int code) {
        for (ResultCodeEnum resultCodeEnum : ResultCodeEnum.values()) {
            if (code == resultCodeEnum.getCode()) {
                return resultCodeEnum;
            }
        }
        return null;
    }
}
