package com.yjh.accessrobot.common.enumeration;

public enum CustomTypeEnum {
    /**
     * 汇控柜
     */
    CUSTOM_TYPE_716("716", "汇控柜", "0"),
    /**
     * 电流表
     */
    CUSTOM_TYPE_749("749", "电流表", "0"),
    /**
     * 接地刀闸位置指示
     */
    CUSTOM_TYPE_774("774", "接地刀闸位置指示", "0"),
    /**
     * 电抗器
     */
    CUSTOM_TYPE_775("775", "电抗器", "0"),
    /**
     * 晶闸管阀外观
     */
    CUSTOM_TYPE_783("783", "晶闸管阀外观", "0"),
    /**
     * 装置外观
     */
    CUSTOM_TYPE_765("765", "装置外观", "0"),
    /**
     * 油位表计
     */
    CUSTOM_TYPE_736("736", "油位表计", "0"),
    /**
     * 终端
     */
    CUSTOM_TYPE_786("786", "终端", "0"),
    /**
     * 基座
     */
    CUSTOM_TYPE_717("717", "基座", "0"),
    /**
     * 金具
     */
    CUSTOM_TYPE_711("711", "金具", "0"),
    /**
     * 光纤柱外观
     */
    CUSTOM_TYPE_782("782", "光纤柱外观", "0"),
    /**
     * 安防
     */
    CUSTOM_TYPE_794("794", "安防", "0"),
    /**
     * 母线
     */
    CUSTOM_TYPE_710("710", "母线", "0"),
    /**
     * 端子箱
     */
    CUSTOM_TYPE_741("741", "端子箱", "0"),
    /**
     * 引流线
     */
    CUSTOM_TYPE_709("709", "引流线", "0"),
    /**
     * 空气开关
     */
    CUSTOM_TYPE_770("770", "空气开关", "0"),
    /**
     * SF6密度继电器（压力表）
     */
    CUSTOM_TYPE_732("732", "SF6密度继电器（压力表）", "0"),
    /**
     * 储能指示
     */
    CUSTOM_TYPE_733("733", "储能指示", "0"),
    /**
     * UPS装置
     */
    CUSTOM_TYPE_756("756", "UPS装置", "0"),
    /**
     * 机械闭锁及限位部分
     */
    CUSTOM_TYPE_718("718", "机械闭锁及限位部分", "0"),
    /**
     * 表计
     */
    CUSTOM_TYPE_768("768", "表计", "0"),
    /**
     * 自动转换开关
     */
    CUSTOM_TYPE_755("755", "自动转换开关", "0"),
    /**
     * 避雷器
     */
    CUSTOM_TYPE_722("722", "避雷器", "0"),
    /**
     * 指示灯
     */
    CUSTOM_TYPE_767("767", "指示灯", "0"),
    /**
     * 充电装置
     */
    CUSTOM_TYPE_759("759", "充电装置", "0"),
    /**
     * 刀闸位置指示
     */
    CUSTOM_TYPE_773("773", "刀闸位置指示", "0"),
    /**
     * 分段断路器
     */
    CUSTOM_TYPE_752("752", "分段断路器", "0"),
    /**
     * 屏柜外观
     */
    CUSTOM_TYPE_764("764", "屏柜外观", "0"),
    /**
     * 电容器
     */
    CUSTOM_TYPE_789("789", "电容器", "0"),
    /**
     * 接地引下线
     */
    CUSTOM_TYPE_723("723", "接地引下线", "0"),
    /**
     * 液晶面板
     */
    CUSTOM_TYPE_766("766", "液晶面板", "0"),
    /**
     * 事故照明屏
     */
    CUSTOM_TYPE_761("761", "事故照明屏", "0"),
    /**
     * 避雷器表计
     */
    CUSTOM_TYPE_731("731", "避雷器表计", "0"),
    /**
     * 环境
     */
    CUSTOM_TYPE_795("795", "环境", "0"),
    /**
     * 放电间隙
     */
    CUSTOM_TYPE_748("748", "放电间隙", "0"),
    /**
     * 馈线屏
     */
    CUSTOM_TYPE_760("760", "馈线屏", "0"),
    /**
     * 本体
     */
    CUSTOM_TYPE_700("700", "本体", "0"),
    /**
     * 操动机构
     */
    CUSTOM_TYPE_704("704", "操动机构", "0"),
    /**
     * 引线
     */
    CUSTOM_TYPE_719("719", "引线", "0"),
    /**
     * 爬梯门
     */
    CUSTOM_TYPE_762("762", "爬梯门", "0"),
    /**
     * 本体及套管
     */
    CUSTOM_TYPE_771("771", "本体及套管", "0"),
    /**
     * 面板
     */
    CUSTOM_TYPE_715("715", "面板", "0"),
    /**
     * 压板
     */
    CUSTOM_TYPE_769("769", "压板", "0"),
    /**
     * 传动部分
     */
    CUSTOM_TYPE_707("707", "传动部分", "0"),
    /**
     * 阀控电抗器
     */
    CUSTOM_TYPE_779("779", "阀控电抗器", "0"),
    /**
     * 固定钢板外观
     */
    CUSTOM_TYPE_784("784", "固定钢板外观", "0"),
    /**
     * 分接开关
     */
    CUSTOM_TYPE_702("702", "分接开关", "0"),
    /**
     * 二次接线盒
     */
    CUSTOM_TYPE_726("726", "二次接线盒", "0"),
    /**
     * 位置指示
     */
    CUSTOM_TYPE_729("729", "位置指示", "0"),
    /**
     * 非电量保护装置
     */
    CUSTOM_TYPE_714("714", "非电量保护装置", "0"),
    /**
     * 套管
     */
    CUSTOM_TYPE_705("705", "套管", "0"),
    /**
     * 支柱绝缘子
     */
    CUSTOM_TYPE_780("780", "支柱绝缘子", "0"),
    /**
     * 进线断路器
     */
    CUSTOM_TYPE_751("751", "进线断路器", "0"),
    /**
     * 引线及接头
     */
    CUSTOM_TYPE_740("740", "引线及接头", "0"),
    /**
     * 母线及引线
     */
    CUSTOM_TYPE_728("728", "母线及引线", "0"),
    /**
     * 排水孔
     */
    CUSTOM_TYPE_763("763", "排水孔", "0"),
    /**
     * 接头
     */
    CUSTOM_TYPE_727("727", "接头", "0"),
    /**
     * 接地箱
     */
    CUSTOM_TYPE_712("712", "接地箱", "0"),
    /**
     * MOV本体
     */
    CUSTOM_TYPE_745("745", "MOV本体", "0"),
    /**
     * 标示牌
     */
    CUSTOM_TYPE_735("735", "标示牌", "0"),
    /**
     * 备自投装置
     */
    CUSTOM_TYPE_757("757", "备自投装置", "0"),
    /**
     * 电缆本体
     */
    CUSTOM_TYPE_785("785", "电缆本体", "0"),
    /**
     * 导电部分
     */
    CUSTOM_TYPE_706("706", "导电部分", "0"),
    /**
     * 整体外观
     */
    CUSTOM_TYPE_725("725", "整体外观", "0"),
    /**
     * 面板
     */
    CUSTOM_TYPE_772("772", "面板", "0"),
    /**
     * 中性点隔离开关
     */
    CUSTOM_TYPE_791("791", "中性点隔离开关", "0"),
    /**
     * 储油柜
     */
    CUSTOM_TYPE_701("701", "储油柜", "0"),
    /**
     * 绝缘子
     */
    CUSTOM_TYPE_708("708", "绝缘子", "0"),
    /**
     * 吸湿器
     */
    CUSTOM_TYPE_737("737", "吸湿器", "0"),
    /**
     * 基础构架
     */
    CUSTOM_TYPE_724("724", "基础构架", "0"),
    /**
     * 切换把手
     */
    CUSTOM_TYPE_754("754", "切换把手", "0"),
    /**
     * 消防
     */
    CUSTOM_TYPE_793("793", "消防", "0"),
    /**
     * 蓄电池
     */
    CUSTOM_TYPE_758("758", "蓄电池", "0"),
    /**
     * 围栏外观
     */
    CUSTOM_TYPE_777("777", "围栏外观", "0"),
    /**
     * 外熔断器
     */
    CUSTOM_TYPE_743("743", "外熔断器", "0"),
    /**
     * 电压表
     */
    CUSTOM_TYPE_750("750", "电压表", "0"),
    /**
     * 电阻分压器
     */
    CUSTOM_TYPE_747("747", "电阻分压器", "0"),
    /**
     * 馈线断路器
     */
    CUSTOM_TYPE_753("753", "馈线断路器", "0"),
    /**
     * 电容器
     */
    CUSTOM_TYPE_720("720", "电容器", "0"),
    /**
     * 油位表计
     */
    CUSTOM_TYPE_744("744", "油位表计", "0"),
    /**
     * 压力释放装置
     */
    CUSTOM_TYPE_730("730", "压力释放装置", "0"),
    /**
     * 冷却系统
     */
    CUSTOM_TYPE_703("703", "冷却系统", "0"),
    /**
     * 均压环
     */
    CUSTOM_TYPE_734("734", "均压环", "0"),
    /**
     * 平台构架外观
     */
    CUSTOM_TYPE_781("781", "平台构架外观", "0"),
    /**
     * 阻尼装置
     */
    CUSTOM_TYPE_778("778", "阻尼装置", "0"),
    /**
     * 接地开关
     */
    CUSTOM_TYPE_792("792", "接地开关", "0"),
    /**
     * 金属膨胀器
     */
    CUSTOM_TYPE_738("738", "金属膨胀器", "0"),
    /**
     * 互感器
     */
    CUSTOM_TYPE_790("790", "互感器", "0"),
    /**
     * 放电线圈油位表计
     */
    CUSTOM_TYPE_776("776", "放电线圈油位表计", "0"),
    /**
     * 分接开关档位
     */
    CUSTOM_TYPE_788("788", "分接开关档位", "0"),
    /**
     * 电流互感器
     */
    CUSTOM_TYPE_746("746", "电流互感器", "0"),
    /**
     * 支撑构架
     */
    CUSTOM_TYPE_713("713", "支撑构架", "0"),
    /**
     * 放电线圈
     */
    CUSTOM_TYPE_721("721", "放电线圈", "0"),
    /**
     * 油温表计
     */
    CUSTOM_TYPE_742("742", "油温表计", "0"),
    /**
     * 末屏
     */
    CUSTOM_TYPE_739("739", "末屏", "0"),
    /**
     * 运行声音
     */
    CUSTOM_TYPE_787("787", "运行声音", "0");

    String dictCode;
    String dictNode;
    String upDict;

    CustomTypeEnum(String dictCode, String dictNode, String upDict) {
        this.dictCode = dictCode;
        this.dictNode = dictNode;
        this.upDict = upDict;
    }

    public String getDictCode() {
        return this.dictCode;
    }

    public String getDictNote() {
        return this.dictNode;
    }

    public String getUpDict() {
        return this.upDict;
    }
}
